# Pandas

How to read csv file and access dataframe

In [1]:
import pandas as pd

In [2]:
pwd

'C:\\udemy\\udemy_tf'

In [3]:
ls

 C 드라이브의 볼륨: Windows
 볼륨 일련 번호: 96C4-2B64

 C:\udemy\udemy_tf 디렉터리

2017-12-17  오후 11:49    <DIR>          .
2017-12-17  오후 11:49    <DIR>          ..
2017-12-17  오후 11:47    <DIR>          .ipynb_checkpoints
2017-12-17  오후 10:27    <DIR>          00-Crash-Course-Basics
2017-12-17  오후 10:27    <DIR>          01-Neural-Network-Basics
2017-12-17  오후 10:27    <DIR>          02-TensorFlow-Basics
2017-12-17  오후 10:27    <DIR>          03-Convolutional-Neural-Networks
2017-12-17  오후 10:27    <DIR>          04-Recurrent-Neural-Networks
2017-12-17  오후 10:27    <DIR>          05-Autoencoders
2017-12-17  오후 10:27    <DIR>          06-Generative-Adversarial-Networks
2017-12-17  오후 10:27    <DIR>          07-Reinforcement-Learning-OpenAI
2017-11-05  오전 12:33           192,512 db.sqlite3
2017-12-17  오후 11:05             1,949 Hyeseon Tensorflow.ipynb
2017-11-05  오전 12:33             1,808 linux_mac_tfdl_env.yml
2017-12-17  오후 10:27    <DIR>          Miscellaneous-Topics
2017-12-17  오후 11:38            17,045 Numpy Practice.ipynb
2017-12-17  오후 11:49               924 Pandas_practice.ipynb
2017-11-05  오전 12:33                25 README.md
2017-11-05  오전 12:33             1,948 tfdl_env.yml
2017-12-17  오후 11:35                72 Untitled.ipynb
               8개 파일             216,283 바이트
              12개 디렉터리   6,498,484,224 바이트 남음

In [6]:
df=pd.read_csv('salaries.csv') # read csv file

In [7]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [8]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [9]:
df[['Salary', 'Name']]

   Salary    Name
0   50000    John
1  120000   Sally
2   80000  Alyssa

In [10]:
df[['Salary']]

   Salary
0   50000
1  120000
2   80000

In [11]:
df['Salary'].max()

120000

In [12]:
df.describe()

              Salary        Age
count       3.000000   3.000000
mean    83333.333333  35.333333
std     35118.845843   9.073772
min     50000.000000  27.000000
25%     65000.000000  30.500000
50%     80000.000000  34.000000
75%    100000.000000  39.500000
max    120000.000000  45.000000

In [13]:
df['Salary']>60000

0    False
1     True
2     True
Name: Salary, dtype: bool

In [15]:
df[df['Salary']>60000]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27

In [16]:
df.as_matrix()

array([['John', 50000, 34],
       ['Sally', 120000, 45],
       ['Alyssa', 80000, 27]], dtype=object)

In [17]:
type(df.as_matrix())

numpy.ndarray

Then, we can use dataframe as numpy by setting df.as_matrix()